Examinator/src/Enums/БазовыйРолиПользователейСУО/БазовыйРолиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>БазовыйРолиПользователейСУО</name>
  <enumValues>
    <name>Учащийся</name>
  </enumValues>
  <enumValues>
    <name>Преподаватель</name>
  </enumValues>
  <enumValues>
    <name>Менеджер</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийПользователь</name>
  </enumValues>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>Разработчик</name>
  </enumValues>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/CommonModules/ОбучениеСУОПовтИсп/Module.bsl
Функция ЕстьПравоПросматриватьВыполненныеЗадания() Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь(,,Ложь)
		ИЛИ РольДоступна("УправлениеПроведениемОбученияСУО") Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Функция СписокБазовыхПравПользователя(Знач Пользователь=Неопределено) Экспорт
	
	СписокПрав = Новый Массив;
	
	Если Пользователь = Неопределено Тогда
		
		Если РольДоступна("УправлениеПроведениемОбученияСУО") Тогда
			СписокПрав.Добавить(Перечисления.БазовыйРолиПользователейСУО.Менеджер);
		КонецЕсли;
		
		Если РольДоступна("ПолныеПрава") Тогда
			СписокПрав.Добавить(Перечисления.БазовыйРолиПользователейСУО.Администратор);
		КонецЕсли;
		
		Если УправлениеОбучениемСУО.ЕстьРольПреподавателя() Тогда
			СписокПрав.Добавить(Перечисления.БазовыйРолиПользователейСУО.Преподаватель);
		КонецЕсли;
		
		Если РольДоступна("ЛичныйКабинетПрохождениеОбученияСУО") Тогда
			СписокПрав.Добавить(Перечисления.БазовыйРолиПользователейСУО.Учащийся);
		КонецЕсли;
		
			
		Если РольДоступна("ЭлектронныеРесурсыРазработкаСУО") Тогда
			СписокПрав.Добавить(Перечисления.БазовыйРолиПользователейСУО.Разработчик);
		КонецЕсли;		
		
	Иначе
	
		// ВАЖНО: Процедура работает неверно в привилегированном режиме, так как функция
		// УправлениеДоступом.ЕстьРоль всегда возвращает Истина в этом режиме.
		
		Если ПривилегированныйРежим() Тогда
			ВызватьИсключение НСтр("ru = 'Получение списка базовых прав в привилегированном режиме не поддерживается.'");
		КонецЕсли;
		
		Если УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО",,Пользователь) Тогда
			СписокПрав.Добавить(Перечисления.БазовыйРолиПользователейСУО.Менеджер);
		КонецЕсли;
		
		Если Пользователи.ЭтоПолноправныйПользователь(Пользователь,,Ложь) Тогда
			СписокПрав.Добавить(Перечисления.БазовыйРолиПользователейСУО.Администратор);
		КонецЕсли;
		
		Если УправлениеОбучениемСУО.ЕстьРольПреподавателя(Пользователь) Тогда
			СписокПрав.Добавить(Перечисления.БазовыйРолиПользователейСУО.Преподаватель);
		КонецЕсли;
		
		Если УправлениеДоступом.ЕстьРоль("ЛичныйКабинетПрохождениеОбученияСУО",,Пользователь) Тогда
			СписокПрав.Добавить(Перечисления.БазовыйРолиПользователейСУО.Учащийся);
		КонецЕсли;
		
				
		Если УправлениеДоступом.ЕстьРоль("ЭлектронныеРесурсыРазработкаСУО",,Пользователь) Тогда
			СписокПрав.Добавить(Перечисления.БазовыйРолиПользователейСУО.Разработчик);
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПрав);
	
КонецФункции
